/var/spool/slurmd/job691404/slurm_script: line 12: /home/username/.bashrc: No such file or directory
CustomCosineAnnealingWarmUpRestarts 적용, batch size: 32, n_workers 4
wandb: Currently logged in as: yein-hwang. Use `wandb login --relogin` to force relogin
wandb: Tracking run with wandb version 0.15.5
wandb: Run data is saved locally in /media/leelabsg-storage1/yein/research/BrainAging/0718/wandb/run-20230721_224807-ms6e98cu
wandb: Run `wandb offline` to turn off syncing.
wandb: Syncing run whole-dream-46
wandb: ⭐️ View project at https://wandb.ai/yein-hwang/lr_test
wandb: 🚀 View run at https://wandb.ai/yein-hwang/lr_test/runs/ms6e98cu
/home/n1/yeinhwang/anaconda3/envs/ba_torch/lib/python3.9/site-packages/torch/utils/data/dataloader.py:560: UserWarning: This DataLoader will create 4 worker processes in total. Our suggested max number of worker in current system is 2, which is smaller than what this DataLoader is going to create. Please be aware that excessive worker creation might get DataLoader running slow or even freeze, lower the worker number to avoid potential slowness/freeze if necessary.
  warnings.warn(_create_warning_msg(
Number of gpus:  4
Age distribution:  count    25656.000000
mean        60.416004
std          7.382716
min         44.000000
25%         54.750000
50%         61.000000
75%         66.000000
max         77.000000
Name: age, dtype: float64
25656
images_names:  19242 23086
labels:  19242 57.0
images_names:  6414 22671
labels:  6414 75.0
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1    [-1, 32, 128, 128, 128]             896
              ReLU-2    [-1, 32, 128, 128, 128]               0
       BatchNorm3d-3    [-1, 32, 128, 128, 128]              64
            Conv3d-4    [-1, 32, 128, 128, 128]          27,680
              ReLU-5    [-1, 32, 128, 128, 128]               0
         Dropout3d-6    [-1, 32, 128, 128, 128]               0
         MaxPool3d-7       [-1, 32, 64, 64, 64]               0
            Conv3d-8       [-1, 64, 64, 64, 64]          55,360
              ReLU-9       [-1, 64, 64, 64, 64]               0
      BatchNorm3d-10       [-1, 64, 64, 64, 64]             128
           Conv3d-11       [-1, 64, 64, 64, 64]         110,656
             ReLU-12       [-1, 64, 64, 64, 64]               0
        Dropout3d-13       [-1, 64, 64, 64, 64]               0
        MaxPool3d-14       [-1, 64, 32, 32, 32]               0
           Conv3d-15       [-1, 64, 32, 32, 32]         110,656
             ReLU-16       [-1, 64, 32, 32, 32]               0
      BatchNorm3d-17       [-1, 64, 32, 32, 32]             128
           Conv3d-18       [-1, 64, 32, 32, 32]         110,656
             ReLU-19       [-1, 64, 32, 32, 32]               0
      BatchNorm3d-20       [-1, 64, 32, 32, 32]             128
        MaxPool3d-21       [-1, 64, 16, 16, 16]               0
           Conv3d-22       [-1, 64, 16, 16, 16]         110,656
             ReLU-23       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-24       [-1, 64, 16, 16, 16]             128
           Conv3d-25       [-1, 64, 16, 16, 16]         110,656
             ReLU-26       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-27       [-1, 64, 16, 16, 16]             128
           Conv3d-28       [-1, 64, 16, 16, 16]         110,656
             ReLU-29       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-30       [-1, 64, 16, 16, 16]             128
        MaxPool3d-31          [-1, 64, 8, 8, 8]               0
           Conv3d-32          [-1, 96, 8, 8, 8]         165,984
             ReLU-33          [-1, 96, 8, 8, 8]               0
      BatchNorm3d-34          [-1, 96, 8, 8, 8]             192
           Conv3d-35          [-1, 96, 8, 8, 8]         248,928
             ReLU-36          [-1, 96, 8, 8, 8]               0
      BatchNorm3d-37          [-1, 96, 8, 8, 8]             192
           Conv3d-38          [-1, 96, 8, 8, 8]         248,928
             ReLU-39          [-1, 96, 8, 8, 8]               0
      BatchNorm3d-40          [-1, 96, 8, 8, 8]             192
        MaxPool3d-41          [-1, 96, 4, 4, 4]               0
           Conv3d-42          [-1, 96, 4, 4, 4]         248,928
             ReLU-43          [-1, 96, 4, 4, 4]               0
      BatchNorm3d-44          [-1, 96, 4, 4, 4]             192
           Conv3d-45          [-1, 96, 4, 4, 4]         248,928
             ReLU-46          [-1, 96, 4, 4, 4]               0
      BatchNorm3d-47          [-1, 96, 4, 4, 4]             192
           Conv3d-48          [-1, 96, 4, 4, 4]         248,928
             ReLU-49          [-1, 96, 4, 4, 4]               0
      BatchNorm3d-50          [-1, 96, 4, 4, 4]             192
        MaxPool3d-51          [-1, 96, 2, 2, 2]               0
           Conv3d-52          [-1, 96, 2, 2, 2]         248,928
             ReLU-53          [-1, 96, 2, 2, 2]               0
      BatchNorm3d-54          [-1, 96, 2, 2, 2]             192
           Conv3d-55          [-1, 96, 2, 2, 2]         248,928
             ReLU-56          [-1, 96, 2, 2, 2]               0
      BatchNorm3d-57          [-1, 96, 2, 2, 2]             192
           Conv3d-58          [-1, 96, 2, 2, 2]         248,928
             ReLU-59          [-1, 96, 2, 2, 2]               0
      BatchNorm3d-60          [-1, 96, 2, 2, 2]             192
          Flatten-61                  [-1, 768]               0
           Linear-62                   [-1, 96]          73,824
             ReLU-63                   [-1, 96]               0
           Linear-64                   [-1, 32]           3,104
             ReLU-65                   [-1, 32]               0
           Linear-66                    [-1, 1]              33
              CNN-67                    [-1, 1]               0
           Conv3d-68    [-1, 32, 128, 128, 128]             896
             ReLU-69    [-1, 32, 128, 128, 128]               0
      BatchNorm3d-70    [-1, 32, 128, 128, 128]              64
           Conv3d-71    [-1, 32, 128, 128, 128]          27,680
             ReLU-72    [-1, 32, 128, 128, 128]               0
        Dropout3d-73    [-1, 32, 128, 128, 128]               0
        MaxPool3d-74       [-1, 32, 64, 64, 64]               0
           Conv3d-75       [-1, 64, 64, 64, 64]          55,360
             ReLU-76       [-1, 64, 64, 64, 64]               0
      BatchNorm3d-77       [-1, 64, 64, 64, 64]             128
           Conv3d-78       [-1, 64, 64, 64, 64]         110,656
             ReLU-79       [-1, 64, 64, 64, 64]               0
        Dropout3d-80       [-1, 64, 64, 64, 64]               0
        MaxPool3d-81       [-1, 64, 32, 32, 32]               0
           Conv3d-82       [-1, 64, 32, 32, 32]         110,656
             ReLU-83       [-1, 64, 32, 32, 32]               0
      BatchNorm3d-84       [-1, 64, 32, 32, 32]             128
           Conv3d-85       [-1, 64, 32, 32, 32]         110,656
             ReLU-86       [-1, 64, 32, 32, 32]               0
      BatchNorm3d-87       [-1, 64, 32, 32, 32]             128
        MaxPool3d-88       [-1, 64, 16, 16, 16]               0
           Conv3d-89       [-1, 64, 16, 16, 16]         110,656
             ReLU-90       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-91       [-1, 64, 16, 16, 16]             128
           Conv3d-92       [-1, 64, 16, 16, 16]         110,656
             ReLU-93       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-94       [-1, 64, 16, 16, 16]             128
           Conv3d-95       [-1, 64, 16, 16, 16]         110,656
             ReLU-96       [-1, 64, 16, 16, 16]               0
      BatchNorm3d-97       [-1, 64, 16, 16, 16]             128
        MaxPool3d-98          [-1, 64, 8, 8, 8]               0
           Conv3d-99          [-1, 96, 8, 8, 8]         165,984
            ReLU-100          [-1, 96, 8, 8, 8]               0
     BatchNorm3d-101          [-1, 96, 8, 8, 8]             192
          Conv3d-102          [-1, 96, 8, 8, 8]         248,928
            ReLU-103          [-1, 96, 8, 8, 8]               0
     BatchNorm3d-104          [-1, 96, 8, 8, 8]             192
          Conv3d-105          [-1, 96, 8, 8, 8]         248,928
            ReLU-106          [-1, 96, 8, 8, 8]               0
     BatchNorm3d-107          [-1, 96, 8, 8, 8]             192
       MaxPool3d-108          [-1, 96, 4, 4, 4]               0
          Conv3d-109          [-1, 96, 4, 4, 4]         248,928
            ReLU-110          [-1, 96, 4, 4, 4]               0
     BatchNorm3d-111          [-1, 96, 4, 4, 4]             192
          Conv3d-112          [-1, 96, 4, 4, 4]         248,928
            ReLU-113          [-1, 96, 4, 4, 4]               0
     BatchNorm3d-114          [-1, 96, 4, 4, 4]             192
          Conv3d-115          [-1, 96, 4, 4, 4]         248,928
            ReLU-116          [-1, 96, 4, 4, 4]               0
     BatchNorm3d-117          [-1, 96, 4, 4, 4]             192
       MaxPool3d-118          [-1, 96, 2, 2, 2]               0
          Conv3d-119          [-1, 96, 2, 2, 2]         248,928
            ReLU-120          [-1, 96, 2, 2, 2]               0
     BatchNorm3d-121          [-1, 96, 2, 2, 2]             192
          Conv3d-122          [-1, 96, 2, 2, 2]         248,928
            ReLU-123          [-1, 96, 2, 2, 2]               0
     BatchNorm3d-124          [-1, 96, 2, 2, 2]             192
          Conv3d-125          [-1, 96, 2, 2, 2]         248,928
            ReLU-126          [-1, 96, 2, 2, 2]               0
     BatchNorm3d-127          [-1, 96, 2, 2, 2]             192
         Flatten-128                  [-1, 768]               0
          Linear-129                   [-1, 96]          73,824
            ReLU-130                   [-1, 96]               0
          Linear-131                   [-1, 32]           3,104
            ReLU-132                   [-1, 32]               0
          Linear-133                    [-1, 1]              33
             CNN-134                    [-1, 1]               0
================================================================
Total params: 5,969,602
Trainable params: 5,969,602
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8.00
Forward/backward pass size (MB): 8080.32
Params size (MB): 22.77
Estimated Total Size (MB): 8111.09
----------------------------------------------------------------
[ Start ]

Epoch   1: training
  0%|          | 0/602 [00:00<?, ?it/s]  0%|          | 1/602 [01:45<17:39:25, 105.77s/it]  0%|          | 2/602 [01:46<7:22:41, 44.27s/it]    0%|          | 3/602 [01:47<4:04:07, 24.45s/it]  1%|          | 4/602 [01:48<2:30:56, 15.14s/it]  1%|          | 5/602 [03:10<6:28:37, 39.06s/it]  1%|          | 6/602 [03:12<4:22:44, 26.45s/it]  1%|          | 7/602 [03:13<2:59:23, 18.09s/it]  1%|▏         | 8/602 [03:13<2:04:49, 12.61s/it]  1%|▏         | 9/602 [04:42<5:59:06, 36.34s/it]  2%|▏         | 10/602 [04:44<4:13:20, 25.68s/it]  2%|▏         | 11/602 [04:45<2:58:08, 18.09s/it]  2%|▏         | 12/602 [04:45<2:06:21, 12.85s/it]  2%|▏         | 13/602 [06:16<5:55:54, 36.25s/it]  2%|▏         | 14/602 [06:17<4:11:38, 25.68s/it]  2%|▏         | 15/602 [06:18<2:58:03, 18.20s/it]  3%|▎         | 16/602 [06:19<2:06:49, 12.99s/it]  3%|▎         | 17/602 [07:47<5:48:32, 35.75s/it]  3%|▎         | 18/602 [07:49<4:09:25, 25.63s/it]  3%|▎         | 19/602 [07:50<2:56:45, 18.19s/it]  3%|▎         | 20/602 [07:51<2:06:01, 12.99s/it]  3%|▎         | 21/602 [09:27<6:07:28, 37.95s/it]  4%|▎         | 22/602 [09:29<4:21:14, 27.03s/it]  4%|▍         | 23/602 [09:30<3:05:03, 19.18s/it]  4%|▍         | 24/602 [09:31<2:11:50, 13.69s/it]  4%|▍         | 25/602 [11:18<6:42:44, 41.88s/it]  4%|▍         | 26/602 [11:20<4:46:50, 29.88s/it]  4%|▍         | 27/602 [11:21<3:22:56, 21.18s/it]  5%|▍         | 28/602 [11:22<2:24:19, 15.09s/it]  5%|▍         | 29/602 [13:07<6:42:05, 42.10s/it]  5%|▍         | 30/602 [13:10<4:48:51, 30.30s/it]  5%|▌         | 31/602 [13:11<3:24:20, 21.47s/it]  5%|▌         | 32/602 [13:13<2:28:30, 15.63s/it]  5%|▌         | 33/602 [14:58<6:43:07, 42.51s/it]  6%|▌         | 34/602 [14:59<4:46:16, 30.24s/it]  6%|▌         | 35/602 [15:00<3:22:31, 21.43s/it]  6%|▌         | 36/602 [15:01<2:23:58, 15.26s/it]  6%|▌         | 37/602 [16:48<6:43:12, 42.82s/it]  6%|▋         | 38/602 [16:50<4:46:02, 30.43s/it]  6%|▋         | 39/602 [16:51<3:22:19, 21.56s/it]  7%|▋         | 40/602 [16:52<2:23:50, 15.36s/it]  7%|▋         | 41/602 [18:39<6:41:19, 42.92s/it]  7%|▋         | 42/602 [18:40<4:44:44, 30.51s/it]  7%|▋         | 43/602 [18:41<3:21:38, 21.64s/it]  7%|▋         | 44/602 [18:42<2:23:19, 15.41s/it]  7%|▋         | 45/602 [20:29<6:37:48, 42.85s/it]  8%|▊         | 46/602 [20:30<4:41:30, 30.38s/it]  8%|▊         | 47/602 [20:31<3:19:49, 21.60s/it]  8%|▊         | 48/602 [20:32<2:22:02, 15.38s/it]  8%|▊         | 49/602 [22:18<6:30:12, 42.34s/it]  8%|▊         | 50/602 [22:19<4:36:37, 30.07s/it]  8%|▊         | 51/602 [22:23<3:23:34, 22.17s/it]  9%|▊         | 52/602 [22:24<2:24:38, 15.78s/it]  9%|▉         | 53/602 [23:44<5:22:15, 35.22s/it]  9%|▉         | 54/602 [23:46<3:49:19, 25.11s/it]  9%|▉         | 55/602 [23:47<2:43:14, 17.91s/it]  9%|▉         | 56/602 [23:48<1:56:25, 12.79s/it]  9%|▉         | 57/602 [24:58<4:33:37, 30.12s/it] 10%|▉         | 58/602 [25:00<3:15:08, 21.52s/it] 10%|▉         | 59/602 [25:03<2:24:08, 15.93s/it] 10%|▉         | 60/602 [25:03<1:43:05, 11.41s/it] 10%|█         | 61/602 [26:13<4:19:35, 28.79s/it] 10%|█         | 62/602 [26:14<3:04:47, 20.53s/it] 10%|█         | 63/602 [26:15<2:12:06, 14.71s/it] 11%|█         | 64/602 [26:16<1:34:39, 10.56s/it] 11%|█         | 65/602 [27:27<4:15:49, 28.58s/it] 11%|█         | 66/602 [27:28<3:03:19, 20.52s/it] 11%|█         | 67/602 [27:30<2:12:28, 14.86s/it] 11%|█▏        | 68/602 [27:31<1:34:53, 10.66s/it] 11%|█▏        | 69/602 [28:44<4:21:22, 29.42s/it] 12%|█▏        | 70/602 [28:46<3:06:38, 21.05s/it] 12%|█▏        | 71/602 [28:46<2:12:43, 15.00s/it] 12%|█▏        | 72/602 [28:47<1:35:03, 10.76s/it] 12%|█▏        | 73/602 [29:58<4:14:11, 28.83s/it] 12%|█▏        | 74/602 [30:00<3:01:31, 20.63s/it] 12%|█▏        | 75/602 [30:01<2:09:07, 14.70s/it] 13%|█▎        | 76/602 [30:02<1:32:30, 10.55s/it] 13%|█▎        | 77/602 [31:12<4:08:33, 28.41s/it] 13%|█▎        | 78/602 [31:13<2:57:46, 20.36s/it] 13%|█▎        | 79/602 [31:14<2:06:29, 14.51s/it] 13%|█▎        | 80/602 [31:15<1:30:38, 10.42s/it] 13%|█▎        | 81/602 [32:24<4:03:57, 28.10s/it] 14%|█▎        | 82/602 [32:26<2:53:58, 20.07s/it] 14%|█▍        | 83/602 [32:27<2:03:49, 14.31s/it] 14%|█▍        | 84/602 [32:27<1:28:46, 10.28s/it] 14%|█▍        | 85/602 [33:40<4:10:24, 29.06s/it] 14%|█▍        | 86/602 [33:42<2:59:28, 20.87s/it] 14%|█▍        | 87/602 [33:43<2:07:38, 14.87s/it] 15%|█▍        | 88/602 [33:44<1:31:25, 10.67s/it] 15%|█▍        | 89/602 [34:55<4:06:20, 28.81s/it] 15%|█▍        | 90/602 [34:56<2:55:58, 20.62s/it] 15%|█▌        | 91/602 [34:57<2:05:10, 14.70s/it] 15%|█▌        | 92/602 [34:58<1:29:41, 10.55s/it] 15%|█▌        | 93/602 [36:09<4:02:07, 28.54s/it] 16%|█▌        | 94/602 [36:10<2:52:34, 20.38s/it] 16%|█▌        | 95/602 [36:11<2:02:46, 14.53s/it] 16%|█▌        | 96/602 [36:12<1:27:59, 10.43s/it] 16%|█▌        | 97/602 [37:22<3:57:50, 28.26s/it] 16%|█▋        | 98/602 [37:23<2:49:28, 20.18s/it] 16%|█▋        | 99/602 [37:24<2:00:35, 14.39s/it] 17%|█▋        | 100/602 [37:25<1:26:26, 10.33s/it] 17%|█▋        | 101/602 [38:34<3:54:35, 28.09s/it] 17%|█▋        | 102/602 [38:35<2:46:49, 20.02s/it] 17%|█▋        | 103/602 [38:36<1:58:43, 14.28s/it] 17%|█▋        | 104/602 [38:37<1:25:06, 10.25s/it] 17%|█▋        | 105/602 [39:48<3:54:43, 28.34s/it] 18%|█▊        | 106/602 [39:49<2:47:08, 20.22s/it] 18%|█▊        | 107/602 [39:50<1:58:55, 14.42s/it] 18%|█▊        | 108/602 [39:51<1:25:14, 10.35s/it] 18%|█▊        | 109/602 [41:02<3:56:11, 28.75s/it] 18%|█▊        | 110/602 [41:04<2:48:09, 20.51s/it] 18%|█▊        | 111/602 [41:05<1:59:36, 14.62s/it] 19%|█▊        | 112/602 [41:05<1:25:42, 10.49s/it] 19%|█▉        | 113/602 [42:16<3:51:47, 28.44s/it] 19%|█▉        | 114/602 [42:17<2:45:06, 20.30s/it] 19%|█▉        | 115/602 [42:18<1:57:27, 14.47s/it] 19%|█▉        | 116/602 [42:19<1:24:10, 10.39s/it] 19%|█▉        | 117/602 [43:28<3:47:18, 28.12s/it] 20%|█▉        | 118/602 [43:29<2:41:30, 20.02s/it] 20%|█▉        | 119/602 [43:30<1:54:56, 14.28s/it] 20%|█▉        | 120/602 [43:31<1:22:24, 10.26s/it] 20%|██        | 121/602 [44:43<3:50:14, 28.72s/it] 20%|██        | 122/602 [44:44<2:44:31, 20.56s/it] 20%|██        | 123/602 [44:45<1:57:01, 14.66s/it] 21%|██        | 124/602 [44:46<1:23:50, 10.52s/it] 21%|██        | 125/602 [45:56<3:45:37, 28.38s/it] 21%|██        | 126/602 [45:58<2:41:45, 20.39s/it] 21%|██        | 127/602 [45:59<1:55:04, 14.54s/it] 21%|██▏       | 128/602 [46:00<1:22:27, 10.44s/it] 21%|██▏       | 129/602 [47:09<3:41:26, 28.09s/it] 22%|██▏       | 130/602 [47:11<2:38:50, 20.19s/it] 22%|██▏       | 131/602 [47:12<1:53:00, 14.40s/it] 22%|██▏       | 132/602 [47:13<1:20:59, 10.34s/it] 22%|██▏       | 133/602 [48:21<3:37:40, 27.85s/it] 22%|██▏       | 134/602 [48:23<2:35:39, 19.96s/it] 22%|██▏       | 135/602 [48:24<1:50:50, 14.24s/it] 23%|██▎       | 136/602 [48:25<1:19:27, 10.23s/it] 23%|██▎       | 137/602 [49:36<3:42:02, 28.65s/it] 23%|██▎       | 138/602 [49:37<2:37:54, 20.42s/it] 23%|██▎       | 139/602 [49:38<1:52:19, 14.56s/it] 23%|██▎       | 140/602 [49:39<1:20:28, 10.45s/it] 23%|██▎       | 141/602 [50:51<3:41:31, 28.83s/it] 24%|██▎       | 142/602 [50:52<2:38:23, 20.66s/it] 24%|██▍       | 143/602 [50:53<1:52:38, 14.72s/it] 24%|██▍       | 144/602 [50:54<1:20:40, 10.57s/it] 24%|██▍       | 145/602 [52:06<3:40:06, 28.90s/it] 24%|██▍       | 146/602 [52:07<2:37:13, 20.69s/it] 24%|██▍       | 147/602 [52:08<1:51:48, 14.74s/it] 25%|██▍       | 148/602 [52:09<1:20:05, 10.58s/it] 25%|██▍       | 149/602 [53:18<3:31:33, 28.02s/it] 25%|██▍       | 150/602 [53:20<2:31:37, 20.13s/it] 25%|██▌       | 151/602 [53:20<1:47:52, 14.35s/it] 25%|██▌       | 152/602 [53:21<1:17:19, 10.31s/it] 25%|██▌       | 153/602 [54:24<3:15:14, 26.09s/it] 26%|██▌       | 154/602 [54:26<2:19:35, 18.70s/it] 26%|██▌       | 155/602 [54:27<1:39:27, 13.35s/it] 26%|██▌       | 156/602 [54:27<1:11:24,  9.61s/it] 26%|██▌       | 157/602 [55:20<2:46:51, 22.50s/it] 26%|██▌       | 158/602 [55:21<1:58:36, 16.03s/it] 26%|██▋       | 159/602 [55:22<1:24:46, 11.48s/it] 27%|██▋       | 160/602 [55:23<1:01:09,  8.30s/it] 27%|██▋       | 161/602 [56:16<2:40:25, 21.83s/it] 27%|██▋       | 162/602 [56:18<1:56:54, 15.94s/it] 27%|██▋       | 163/602 [56:19<1:23:34, 11.42s/it] 27%|██▋       | 164/602 [56:20<1:00:16,  8.26s/it] 27%|██▋       | 165/602 [57:31<3:17:08, 27.07s/it] 28%|██▊       | 166/602 [57:32<2:20:26, 19.33s/it] 28%|██▊       | 167/602 [57:33<1:39:59, 13.79s/it] 28%|██▊       | 168/602 [57:34<1:11:43,  9.92s/it] 28%|██▊       | 169/602 [58:44<3:21:05, 27.86s/it] 28%|██▊       | 170/602 [58:45<2:23:25, 19.92s/it] 28%|██▊       | 171/602 [58:46<1:42:02, 14.21s/it] 29%|██▊       | 172/602 [58:47<1:13:09, 10.21s/it] 29%|██▊       | 173/602 [1:00:00<3:28:42, 29.19s/it] 29%|██▉       | 174/602 [1:00:02<2:28:30, 20.82s/it] 29%|██▉       | 175/602 [1:00:03<1:45:35, 14.84s/it] 29%|██▉       | 176/602 [1:00:03<1:15:36, 10.65s/it] 29%|██▉       | 177/602 [1:01:14<3:22:13, 28.55s/it] 30%|██▉       | 178/602 [1:01:15<2:24:06, 20.39s/it] 30%|██▉       | 179/602 [1:01:16<1:42:29, 14.54s/it] 30%|██▉       | 180/602 [1:01:17<1:13:24, 10.44s/it] 30%|███       | 181/602 [1:02:29<3:22:53, 28.92s/it] 30%|███       | 182/602 [1:02:30<2:24:45, 20.68s/it] 30%|███       | 183/602 [1:02:31<1:42:55, 14.74s/it] 31%|███       | 184/602 [1:02:32<1:13:42, 10.58s/it] 31%|███       | 185/602 [1:03:44<3:20:37, 28.87s/it] 31%|███       | 186/602 [1:03:45<2:23:01, 20.63s/it] 31%|███       | 187/602 [1:03:46<1:41:41, 14.70s/it] 31%|███       | 188/602 [1:03:47<1:12:49, 10.55s/it] 31%|███▏      | 189/602 [1:04:58<3:18:44, 28.87s/it] 32%|███▏      | 190/602 [1:04:59<2:20:54, 20.52s/it] 32%|███▏      | 191/602 [1:05:00<1:40:11, 14.63s/it] 32%|███▏      | 192/602 [1:05:01<1:11:45, 10.50s/it] 32%|███▏      | 193/602 [1:06:12<3:14:27, 28.53s/it] 32%|███▏      | 194/602 [1:06:13<2:18:33, 20.38s/it] 32%|███▏      | 195/602 [1:06:14<1:38:32, 14.53s/it] 33%|███▎      | 196/602 [1:06:15<1:11:39, 10.59s/it] 33%|███▎      | 197/602 [1:07:24<3:09:23, 28.06s/it] 33%|███▎      | 198/602 [1:07:26<2:14:55, 20.04s/it] 33%|███▎      | 199/602 [1:07:27<1:36:49, 14.42s/it] 33%|███▎      | 200/602 [1:07:28<1:09:21, 10.35s/it]